{
  "_name_or_path": "sergiopaniego/detr-resnet-50-dc5-fashionpedia-finetuned",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "backbone_config": null,
  "backbone_kwargs": {
    "in_chans": 3,
    "out_indices": [
      1,
      2,
      3,
      4
    ],
    "output_stride": 16
  },
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "classifier_dropout": 0.0,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": true,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "shirt, blouse",
    "1": "top, t-shirt, sweatshirt",
    "2": "sweater",
    "3": "cardigan",
    "4": "jacket",
    "5": "vest",
    "6": "pants",
    "7": "shorts",
    "8": "skirt",
    "9": "coat",
    "10": "dress",
    "11": "jumpsuit",
    "12": "cape",
    "13": "glasses",
    "14": "hat",
    "15": "headband, head covering, hair accessory",
    "16": "tie",
    "17": "glove",
    "18": "watch",
    "19": "belt",
    "20": "leg warmer",
    "21": "tights, stockings",
    "22": "sock",
    "23": "shoe",
    "24": "bag, wallet",
    "25": "scarf",
    "26": "umbrella",
    "27": "hood",
    "28": "collar",
    "29": "lapel",
    "30": "epaulette",
    "31": "sleeve",
    "32": "pocket",
    "33": "neckline",
    "34": "buckle",
    "35": "zipper",
    "36": "applique",
    "37": "bead",
    "38": "bow",
    "39": "flower",
    "40": "fringe",
    "41": "ribbon",
    "42": "rivet",
    "43": "ruffle",
    "44": "sequin",
    "45": "tassel"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "applique": 36,
    "bag, wallet": 24,
    "bead": 37,
    "belt": 19,
    "bow": 38,
    "buckle": 34,
    "cape": 12,
    "cardigan": 3,
    "coat": 9,
    "collar": 28,
    "dress": 10,
    "epaulette": 30,
    "flower": 39,
    "fringe": 40,
    "glasses": 13,
    "glove": 17,
    "hat": 14,
    "headband, head covering, hair accessory": 15,
    "hood": 27,
    "jacket": 4,
    "jumpsuit": 11,
    "lapel": 29,
    "leg warmer": 20,
    "neckline": 33,
    "pants": 6,
    "pocket": 32,
    "ribbon": 41,
    "rivet": 42,
    "ruffle": 43,
    "scarf": 25,
    "sequin": 44,
    "shirt, blouse": 0,
    "shoe": 23,
    "shorts": 7,
    "skirt": 8,
    "sleeve": 31,
    "sock": 22,
    "sweater": 2,
    "tassel": 45,
    "tie": 16,
    "tights, stockings": 21,
    "top, t-shirt, sweatshirt": 1,
    "umbrella": 26,
    "vest": 5,
    "watch": 18,
    "zipper": 35
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "detr",
  "num_channels": 3,
  "num_hidden_layers": 6,
  "num_queries": 100,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "use_pretrained_backbone": true,
  "use_timm_backbone": true
}
